Terraform plan for __staging__
<details>
  <summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_service_account_iam_member.invoice_service_account will be created
  + resource "google_service_account_iam_member" "invoice_service_account" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:ebo-staging.svc.id.goog[invoice/invoice-file-upload]"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = "********************************************************************************************"
    }

  # kubernetes_service_account.invoice_service_account will be created
  + resource "kubernetes_service_account" "invoice_service_account" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = {
              + "iam.gke.io/gcp-service-account" = "invoice-file-upload@ebo-staging.iam.gserviceaccount.com"
            }
          + generation       = (known after apply)
          + name             = "invoice-file-upload"
          + namespace        = "invoice"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Provider helm is undefined

  on istio_telemetry_gke.tf line 27, in module "istio_telemetry_proxy":
  27:     helm = helm.gke

Module module.istio_telemetry_proxy does not declare a provider named helm.
If you wish to specify a provider configuration for the module, add an entry
for helm in the required_providers block within the module.

Warning: Provider kubernetes is undefined

  on jumpbox.tf line 3, in module "jumpbox":
   3:     kubernetes = kubernetes.gke

Module module.jumpbox does not declare a provider named kubernetes.
If you wish to specify a provider configuration for the module, add an entry
for kubernetes in the required_providers block within the module.
```
</details>

Plan generated in [Terraform #233](https://github.com/ebomart/commerce-infrastructure/actions/runs/1310613222)